---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.#ctor
source: html/f8285bed-770d-498f-2d8c-0583bfcc36c6.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.#ctor Method

Initializes a new instance of the IntersectionResultArray class

## Syntax (C#)
```csharp
public IntersectionResultArray()
```